wsdl-schema-parser/src/test/resources/wsdls/xmethods/http.__www.spraci.com_services_soap_index.php_wsdl.wsdl

<?xml version="1.0" encoding="ISO-8859-1"?><definitions xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.spraci.com/services/soap/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.spraci.com/services/soap/"><types><xsd:schema targetNamespace="http://www.spraci.com/services/soap/"> <xsd:import namespace="http://schemas.xmlsoap.org/soap/encoding/" /> <xsd:import namespace="http://schemas.xmlsoap.org/wsdl/" /> <xsd:complexType name="AreaFetch">  <xsd:all>   <xsd:element name="appkey" type="xsd:string"/>   <xsd:element name="username" type="xsd:string"/>   <xsd:element name="password" type="xsd:string"/>   <xsd:element name="area" type="xsd:string"/>   <xsd:element name="name" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="UserFetch">  <xsd:all>   <xsd:element name="appkey" type="xsd:string"/>   <xsd:element name="username" type="xsd:string"/>   <xsd:element name="password" type="xsd:string"/>   <xsd:element name="user_id" type="xsd:string"/>   <xsd:element name="user_name" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="EventFetch">  <xsd:all>   <xsd:element name="appkey" type="xsd:string"/>   <xsd:element name="username" type="xsd:string"/>   <xsd:element name="password" type="xsd:string"/>   <xsd:element name="event_id" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="EventAdd">  <xsd:all>   <xsd:element name="appkey" type="xsd:string"/>   <xsd:element name="username" type="xsd:string"/>   <xsd:element name="password" type="xsd:string"/>   <xsd:element name="area" type="xsd:string"/>   <xsd:element name="name" type="xsd:string"/>   <xsd:element name="start_date" type="xsd:string"/>   <xsd:element name="start_time" type="xsd:string"/>   <xsd:element name="end_date" type="xsd:string"/>   <xsd:element name="end_time" type="xsd:string"/>   <xsd:element name="venue" type="xsd:string"/>   <xsd:element name="categories" type="xsd:string"/>   <xsd:element name="description" type="xsd:string"/>   <xsd:element name="long_description" type="xsd:string"/>   <xsd:element name="link_url" type="xsd:string"/>   <xsd:element name="link_name" type="xsd:string"/>   <xsd:element name="ticket_link" type="xsd:string"/>   <xsd:element name="type" type="xsd:string"/>   <xsd:element name="event_id" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="EventListFetch">  <xsd:all>   <xsd:element name="appkey" type="xsd:string"/>   <xsd:element name="username" type="xsd:string"/>   <xsd:element name="password" type="xsd:string"/>   <xsd:element name="area" type="xsd:string"/>   <xsd:element name="tag" type="xsd:string"/>   <xsd:element name="user_id" type="xsd:string"/>   <xsd:element name="user_name" type="xsd:string"/>   <xsd:element name="searchtext" type="xsd:string"/>   <xsd:element name="page" type="xsd:string"/>   <xsd:element name="per_page" type="xsd:string"/>   <xsd:element name="type" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="AreaRes">  <xsd:all>   <xsd:element name="area_id" type="xsd:string"/>   <xsd:element name="name" type="xsd:string"/>   <xsd:element name="keyword" type="xsd:string"/>   <xsd:element name="parent" type="xsd:string"/>   <xsd:element name="timezone" type="xsd:string"/>   <xsd:element name="latitude" type="xsd:string"/>   <xsd:element name="longitude" type="xsd:string"/>   <xsd:element name="tzid" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="UserRes">  <xsd:all>   <xsd:element name="user_id" type="xsd:string"/>   <xsd:element name="user_name" type="xsd:string"/>   <xsd:element name="link" type="xsd:string"/>   <xsd:element name="blog" type="xsd:string"/>   <xsd:element name="area" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="EventRes">  <xsd:all>   <xsd:element name="event_id" type="xsd:string"/>   <xsd:element name="name" type="xsd:string"/>   <xsd:element name="start_date" type="xsd:string"/>   <xsd:element name="start_time" type="xsd:string"/>   <xsd:element name="end_date" type="xsd:string"/>   <xsd:element name="end_time" type="xsd:string"/>   <xsd:element name="venue" type="xsd:string"/>   <xsd:element name="description" type="xsd:string"/>   <xsd:element name="link" type="xsd:string"/>   <xsd:element name="area" type="xsd:string"/>   <xsd:element name="categories" type="xsd:string"/>   <xsd:element name="modified" type="xsd:string"/>   <xsd:element name="recurring" type="xsd:string"/>   <xsd:element name="type" type="xsd:string"/>   <xsd:element name="link_url" type="xsd:string"/>   <xsd:element name="link_name" type="xsd:string"/>   <xsd:element name="ticket_link" type="xsd:string"/>   <xsd:element name="user_id" type="xsd:string"/>  </xsd:all> </xsd:complexType> <xsd:complexType name="AreaList">  <xsd:complexContent>   <xsd:restriction base="SOAP-ENC:Array">    <xsd:attribute ref="SOAP-ENC:arrayType" wsdl:arrayType="tns:AreaRes[]"/>   </xsd:restriction>  </xsd:complexContent> </xsd:complexType> <xsd:complexType name="EventList">  <xsd:complexContent>   <xsd:restriction base="SOAP-ENC:Array">    <xsd:attribute ref="SOAP-ENC:arrayType" wsdl:arrayType="tns:EventRes[]"/>   </xsd:restriction>  </xsd:complexContent> </xsd:complexType></xsd:schema></types><message name="area_listRequest"><part name="data" type="tns:AreaFetch" /></message><message name="area_listResponse"><part name="return" type="tns:AreaList" /></message><message name="area_getinfoRequest"><part name="inputStructArray" type="tns:AreaFetch" /></message><message name="area_getinfoResponse"><part name="return" type="tns:AreaRes" /></message><message name="event_listRequest"><part name="data" type="tns:EventListFetch" /></message><message name="event_listResponse"><part name="return" type="tns:EventList" /></message><message name="event_getinfoRequest"><part name="data" type="tns:EventFetch" /></message><message name="event_getinfoResponse"><part name="return" type="tns:EventRes" /></message><message name="event_showRequest"><part name="data" type="tns:EventFetch" /></message><message name="event_showResponse"><part name="return" type="tns:EventRes" /></message><message name="event_addRequest"><part name="data" type="tns:EventAdd" /></message><message name="event_addResponse"><part name="return" type="tns:EventFetch" /></message><message name="event_updateRequest"><part name="data" type="tns:EventAdd" /></message><message name="event_updateResponse"><part name="return" type="tns:EventFetch" /></message><message name="user_getinfoRequest"><part name="data" type="tns:UserFetch" /></message><message name="user_getinfoResponse"><part name="return" type="tns:UserRes" /></message><message name="user_getareaRequest"><part name="data" type="tns:UserFetch" /></message><message name="user_getareaResponse"><part name="return" type="tns:AreaRes" /></message><portType name="SPRACIPortType"><operation name="area_list"><documentation>get list of areas inside an area</documentation><input message="tns:area_listRequest"/><output message="tns:area_listResponse"/></operation><operation name="area_getinfo"><documentation>get info about an area</documentation><input message="tns:area_getinfoRequest"/><output message="tns:area_getinfoResponse"/></operation><operation name="event_list"><documentation>get list of events for an area</documentation><input message="tns:event_listRequest"/><output message="tns:event_listResponse"/></operation><operation name="event_getinfo"><documentation>get event details</documentation><input message="tns:event_getinfoRequest"/><output message="tns:event_getinfoResponse"/></operation><operation name="event_show"><documentation>get event data</documentation><input message="tns:event_showRequest"/><output message="tns:event_showResponse"/></operation><operation name="event_add"><documentation>add new event</documentation><input message="tns:event_addRequest"/><output message="tns:event_addResponse"/></operation><operation name="event_update"><documentation>update existing event</documentation><input message="tns:event_updateRequest"/><output message="tns:event_updateResponse"/></operation><operation name="user_getinfo"><documentation>get user details</documentation><input message="tns:user_getinfoRequest"/><output message="tns:user_getinfoResponse"/></operation><operation name="user_getarea"><documentation>get user area details</documentation><input message="tns:user_getareaRequest"/><output message="tns:user_getareaResponse"/></operation></portType><binding name="SPRACIBinding" type="tns:SPRACIPortType"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="area_list"><soap:operation soapAction="urn:SPRACI#area_list" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="area_getinfo"><soap:operation soapAction="urn:SPRACI#area_getinfo" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="event_list"><soap:operation soapAction="urn:SPRACI#event_search" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="event_getinfo"><soap:operation soapAction="urn:SPRACI#event_getinfo" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="event_show"><soap:operation soapAction="urn:SPRACI#event_show" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="event_add"><soap:operation soapAction="urn:SPRACI#event_add" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="event_update"><soap:operation soapAction="urn:SPRACI#event_update" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="user_getinfo"><soap:operation soapAction="urn:SPRACI#user_getinfo" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="user_getarea"><soap:operation soapAction="urn:SPRACI#user_getarea" style="rpc"/><input><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="http://www.spraci.com/services/soap/" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation></binding><service name="SPRACI"><port name="SPRACIPort" binding="tns:SPRACIBinding"><soap:address location="http://www.spraci.com/services/soap/index.php"/></port></service></definitions>